tap "homebrew/bundle"
tap "koekeishiya/formulae"

brew "bat", desc: "Clone of cat(1) with syntax highlighting and Git integration"
brew "bpytop", desc: "Linux/OSX/FreeBSD resource monitor"
brew "ctop", desc: "Top-like interface for container metrics"
brew "diff-so-fancy", desc: "Good-lookin' diffs with diff-highlight and more"
brew "dos2unix", desc: "Convert text between DOS, UNIX, and Mac formats"
brew "dua-cli", desc: "View disk space usage and delete unwanted data, fast"
brew "fd", desc: "Simple, fast and user-friendly alternative to find"
brew "figlet", desc: "Banner-like program prints strings as ASCII art"
brew "fnm", desc: "Fast and simple Node.js version manager"
brew "fzf", desc: "Command-line fuzzy finder written in Go"
brew "gping", desc: "Ping, but with a graph"
brew "htop", desc: "Improved top (interactive process viewer)"
brew "hurl", desc: "Run and Test HTTP Requests with plain text and curl"
brew "jq", desc: "Lightweight and flexible command-line JSON processor"
brew "koekeishiya/formulae/skhd", desc: "Simple hotkey-daemon for macOS."
brew "koekeishiya/formulae/yabai", desc: "A tiling window manager for macOS based on binary space partitioning."
brew "lazydocker", desc: "Lazier way to manage everything docker"
brew "lazygit", desc: "Simple terminal UI for git commands"
brew "ncdu", desc: "NCurses Disk Usage"
brew "tree-sitter", desc: "Parser generator tool and incremental parsing library"
brew "neovim", desc: "Ambitious Vim-fork focused on extensibility and agility"
brew "neovim-remote", desc: "Control nvim processes using `nvr` command-line tool"
brew "pyenv", desc: "Python version management"
brew "ripgrep", desc: "Search tool like grep and The Silver Searcher"
brew "stow", desc: "Organize software neatly under a single directory tree (e.g. /usr/local)"
brew "tidy-html5", desc: "Granddaddy of HTML tools, with support for modern standards"
brew "tldr", desc: "Simplified and community-driven man pages"
brew "tmux", desc: "Terminal multiplexer"
brew "tre-command", desc: "Tree command, improved"
brew "tree", desc: "Display directories as trees (with optional color/HTML output)"
brew "vegeta", desc: "HTTP load testing tool and library"
brew "webp", desc: "Image format providing lossless and lossy compression for web images"
cask "alacritty", desc: "GPU-accelerated terminal emulator"
cask "bambu-studio", desc: "3D model slicing software for 3D printers"
cask "brave-browser", desc: "Web browser focusing on privacy"
cask "camo-studio", desc: "Use your phone as a high-quality webcam with image tuning controls"
cask "cleanmymac", desc: "Tool to remove unnecessary files and folders from disk"
cask "docker", desc: "App to build and share containerised applications and microservices"
cask "font-fira-code-nerd-font", desc: "Developer targeted fonts with a high number of glyphs"
cask "font-jetbrains-mono-nerd-font", desc: "Developer targeted fonts with a high number of glyphs"
cask "ghostty", desc: "Terminal emulator that uses platform-native UI and GPU acceleration"
cask "gimp", desc: "GNU Image Manipulation Program"
cask "hiddenbar", desc: "Utility to hide menu bar items"
cask "insomnia", desc: "HTTP and GraphQL Client"
cask "istat-menus", desc: "System monitoring app"
cask "key-codes", desc: "Display key code, unicode value and modifier keys state for any key combination"
cask "netnewswire", desc: "Free and open-source RSS reader"
cask "obs", desc: "Open-source software for live streaming and screen recording"
cask "obsidian", desc: "Knowledge base that works on top of a local folder of plain text Markdown files"
cask "raycast", desc: "Control your tools with a few keystrokes"
cask "sourcetree", desc: "Graphical client for Git version control"
cask "tableplus", desc: "Native GUI tool for relational databases"
cask "transmit", desc: "File transfer application"
cask "vlc", desc: "Multimedia player"
